<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/3c01f770-ae77-49ce-af5f-cccf232e78b1/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_policy.ecs_target_cpu will be created
  + resource "aws_appautoscaling_policy" "ecs_target_cpu" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "application-scaling-policy-cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.ecs_target_memory will be created
  + resource "aws_appautoscaling_policy" "ecs_target_memory" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "application-scaling-policy-memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 8
      + min_capacity       = 2
      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"
      + role_arn           = "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs.aws_ecs_service.app_service is tainted, so must be replaced
-/+ resource "aws_ecs_service" "app_service" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service" -> (known after apply)
        name                               = "staging_keyserver-service"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - tags                               = {} -> null
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:40" -> (known after apply)
        # (11 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-0f797002e8d61a78a",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:40" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_keyserver" -> (known after apply)
      ~ revision                 = 40 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb.load_balancer will be updated in-place
  ~ resource "aws_lb" "load_balancer" {
        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-staging-keyserver-d4e/5d5f284061ee67df"
        name                             = "staging-staging-keyserver-d4e"
      ~ security_groups                  = [
          - "sg-08f53814774cb5a48",
        ] -> (known after apply)
        tags                             = {}
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_lb_target_group.target_group (deposed object 46e9632d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - arn_suffix                         = "targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "30" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - name                               = "staging-keyserver-7ab" -> null
      - port                               = 8080 -> null
      - preserve_client_ip                 = "false" -> null
      - protocol                           = "TCP" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09dce0b23af575478" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 10 -> null
          - matcher             = "200-399" -> null
          - path                = "/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 6 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 0 -> null
          - enabled         = false -> null
          - type            = "source_ip" -> null
        }
    }

  # module.ecs.aws_lb_target_group.target_group (deposed object e1509152) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null
      - arn_suffix                         = "targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "staging-staging-keyserver-8e5" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 30 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09dce0b23af575478" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 15 -> null
          - matcher             = "200" -> null
          - path                = "/health" -> null
          - port                = "80" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 10 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.ecs.aws_lb_target_group.target_group (deposed object e84c2cb9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lb_target_group" "target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null
      - arn_suffix                         = "targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "staging-keyserver-b26" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 30 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-09dce0b23af575478" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 15 -> null
          - matcher             = "200" -> null
          - path                = "/health" -> null
          - port                = "8080" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 10 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }

  # module.ecs.aws_security_group.app_ingress must be replaced
+/- resource "aws_security_group" "app_ingress" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0f797002e8d61a78a" -> (known after apply)
      ~ id                     = "sg-0f797002e8d61a78a" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-08f53814774cb5a48",
                ]
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
      ~ name                   = "staging-keyserver-d7f-app-ingress" # forces replacement -> (known after apply) # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 15988ebd) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0b7723d9d0a19b655" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0b7723d9d0a19b655" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0f1661854871685a5",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-keyserver-app-ingress-b9b" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 30041f82) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-07237821707d8552f" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-07237821707d8552f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0e775953e2d0059a0",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-e0b" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 343bcef7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0dae7acb1fc5a8b00" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0dae7acb1fc5a8b00" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0f9a385f74165e34c",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-212" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 87412497) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0287c8f4956a0865d" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0287c8f4956a0865d" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-03249f65f2bbdf803",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-keyserver-788-app-ingress" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 8ce2b8fc) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0bc18f1f55f7feef3" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0bc18f1f55f7feef3" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-06c64e4d9a8dc24ad",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-f25" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object 999d9d41) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-052baef3342b8d9f9" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-052baef3342b8d9f9" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0476ae0a70f2b39bd",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-6a1" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object c2a5c2ec) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-06d860f341a56e506" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-06d860f341a56e506" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0fdb5104bf67271b6",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-keyserver-66d-app-ingress" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.app_ingress (deposed object e47de569) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "app_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0957ca2b3b7d67efb" -> null
      - description            = "Allow app port ingress" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0957ca2b3b7d67efb" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0920046fe037e6133",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "staging-staging-keyserver-app-ingress-5ba" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress must be replaced
+/- resource "aws_security_group" "lb_ingress" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-08f53814774cb5a48" -> (known after apply)
      ~ id                     = "sg-08f53814774cb5a48" -> (known after apply)
      ~ name                   = "staging-keyserver-d7f-lb-ingress" # forces replacement -> (known after apply) # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
        # (6 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object 1e4a61b9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-03249f65f2bbdf803" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-03249f65f2bbdf803" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-keyserver-788-lb-ingress" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object 3c38b5a6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0fdb5104bf67271b6" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0fdb5104bf67271b6" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-keyserver-66d-lb-ingress" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object 8c150c41) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0476ae0a70f2b39bd" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0476ae0a70f2b39bd" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-888" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object a353e579) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0920046fe037e6133" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0920046fe037e6133" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-1b7" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object ac15d8c7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0f1661854871685a5" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f1661854871685a5" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-keyserver-lb-ingress-ed6" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object b220dee6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-06c64e4d9a8dc24ad" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-06c64e4d9a8dc24ad" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-7b7" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object f19326a9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0e775953e2d0059a0" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0e775953e2d0059a0" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-361" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_security_group.lb_ingress (deposed object fb7f2d77) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_security_group" "lb_ingress" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0f9a385f74165e34c" -> null
      - description            = "Allow app port ingress from vpc" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f9a385f74165e34c" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "staging-staging-keyserver-lb-ingress-4bf" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

Plan: 7 to add, 1 to change, 23 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_policy.ecs_target_cpu will be created%0A  + resource "aws_appautoscaling_policy" "ecs_target_cpu" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "application-scaling-policy-cpu"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in = false%0A          + target_value     = 80%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageCPUUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_appautoscaling_policy.ecs_target_memory will be created%0A  + resource "aws_appautoscaling_policy" "ecs_target_memory" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "application-scaling-policy-memory"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in = false%0A          + target_value     = 80%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be created%0A  + resource "aws_appautoscaling_target" "ecs_target" {%0A      + id                 = (known after apply)%0A      + max_capacity       = 8%0A      + min_capacity       = 2%0A      + resource_id        = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      + role_arn           = "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service is tainted, so must be replaced%0A-/+ resource "aws_ecs_service" "app_service" {%0A      - health_check_grace_period_seconds  = 0 -> null%0A      ~ iam_role                           = "aws-service-role" -> (known after apply)%0A      ~ id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service" -> (known after apply)%0A        name                               = "staging_keyserver-service"%0A      ~ platform_version                   = "LATEST" -> (known after apply)%0A      - tags                               = {} -> null%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:40" -> (known after apply)%0A        # (11 unchanged attributes hidden)%0A%0A      - deployment_circuit_breaker {%0A          - enable   = false -> null%0A          - rollback = false -> null%0A        }%0A%0A      - deployment_controller {%0A          - type = "ECS" -> null%0A        }%0A%0A      ~ network_configuration {%0A          ~ security_groups  = [%0A              - "sg-0f797002e8d61a78a",%0A            ] -> (known after apply)%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:40" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging_keyserver" -> (known after apply)%0A      ~ revision                 = 40 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_lb.load_balancer will be updated in-place%0A  ~ resource "aws_lb" "load_balancer" {%0A        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-staging-keyserver-d4e/5d5f284061ee67df"%0A        name                             = "staging-staging-keyserver-d4e"%0A      ~ security_groups                  = [%0A          - "sg-08f53814774cb5a48",%0A        ] -> (known after apply)%0A        tags                             = {}%0A        # (17 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group (deposed object 46e9632d) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_lb_target_group" "target_group" {%0A      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null%0A      - arn_suffix                         = "targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null%0A      - connection_termination             = false -> null%0A      - deregistration_delay               = "30" -> null%0A      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-7ab/a634a90b6f38bbd4" -> null%0A      - lambda_multi_value_headers_enabled = false -> null%0A      - name                               = "staging-keyserver-7ab" -> null%0A      - port                               = 8080 -> null%0A      - preserve_client_ip                 = "false" -> null%0A      - protocol                           = "TCP" -> null%0A      - proxy_protocol_v2                  = false -> null%0A      - slow_start                         = 0 -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - target_type                        = "ip" -> null%0A      - vpc_id                             = "vpc-09dce0b23af575478" -> null%0A%0A      - health_check {%0A          - enabled             = true -> null%0A          - healthy_threshold   = 2 -> null%0A          - interval            = 10 -> null%0A          - matcher             = "200-399" -> null%0A          - path                = "/health" -> null%0A          - port                = "traffic-port" -> null%0A          - protocol            = "HTTP" -> null%0A          - timeout             = 6 -> null%0A          - unhealthy_threshold = 2 -> null%0A        }%0A%0A      - stickiness {%0A          - cookie_duration = 0 -> null%0A          - enabled         = false -> null%0A          - type            = "source_ip" -> null%0A        }%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group (deposed object e1509152) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_lb_target_group" "target_group" {%0A      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null%0A      - arn_suffix                         = "targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null%0A      - connection_termination             = false -> null%0A      - deregistration_delay               = "300" -> null%0A      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-staging-keyserver-8e5/094cb60cca426919" -> null%0A      - lambda_multi_value_headers_enabled = false -> null%0A      - load_balancing_algorithm_type      = "round_robin" -> null%0A      - name                               = "staging-staging-keyserver-8e5" -> null%0A      - port                               = 80 -> null%0A      - protocol                           = "HTTP" -> null%0A      - protocol_version                   = "HTTP1" -> null%0A      - proxy_protocol_v2                  = false -> null%0A      - slow_start                         = 30 -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - target_type                        = "ip" -> null%0A      - vpc_id                             = "vpc-09dce0b23af575478" -> null%0A%0A      - health_check {%0A          - enabled             = true -> null%0A          - healthy_threshold   = 2 -> null%0A          - interval            = 15 -> null%0A          - matcher             = "200" -> null%0A          - path                = "/health" -> null%0A          - port                = "80" -> null%0A          - protocol            = "HTTP" -> null%0A          - timeout             = 10 -> null%0A          - unhealthy_threshold = 2 -> null%0A        }%0A%0A      - stickiness {%0A          - cookie_duration = 86400 -> null%0A          - enabled         = false -> null%0A          - type            = "lb_cookie" -> null%0A        }%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group (deposed object e84c2cb9) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_lb_target_group" "target_group" {%0A      - arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null%0A      - arn_suffix                         = "targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null%0A      - connection_termination             = false -> null%0A      - deregistration_delay               = "300" -> null%0A      - id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-b26/f8fbba44156675be" -> null%0A      - lambda_multi_value_headers_enabled = false -> null%0A      - load_balancing_algorithm_type      = "round_robin" -> null%0A      - name                               = "staging-keyserver-b26" -> null%0A      - port                               = 8080 -> null%0A      - protocol                           = "HTTP" -> null%0A      - protocol_version                   = "HTTP1" -> null%0A      - proxy_protocol_v2                  = false -> null%0A      - slow_start                         = 30 -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - target_type                        = "ip" -> null%0A      - vpc_id                             = "vpc-09dce0b23af575478" -> null%0A%0A      - health_check {%0A          - enabled             = true -> null%0A          - healthy_threshold   = 2 -> null%0A          - interval            = 15 -> null%0A          - matcher             = "200
...

```

</details>

*Action: `pull_request`*